tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "osgeo/osgeo4mac"
# Search tool like grep, but optimized for programmers
brew "ack"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Portable Foreign Function Interface library
brew "libffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Real-time data compression library
brew "lzo"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Freely available high-quality data compressor
brew "bzip2"
# Asynchronous DNS library
brew "c-ares"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# malloc implementation emphasizing fragmentation avoidance
brew "jemalloc"
# Asynchronous event library
brew "libev"
# Asynchronous event library
brew "libevent"
# C library implementing the SSH2 protocol
brew "libssh2"
# HTTP/2 C Library
brew "nghttp2"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# YAML Parser
brew "libyaml"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Command-line tool for DigitalOcean
brew "doctl"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# Bandwidth-efficient encrypted backup
brew "duplicity"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# Programming language for highly scalable real-time systems
brew "erlang"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Geospatial Data Abstraction Library
brew "gdal"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# RAD tool for the GTK+ and GNOME environment
brew "glade"
# Terminal interface for viewing git repositories
brew "grv"
# Numerical library for C and C++
brew "gsl"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Powerful, lightweight programming language
brew "lua"
# Java-based project management
brew "maven"
# Python implementation for microcontrollers and constrained systems
brew "micropython"
# Library for creating multi-platform software
brew "s-lang"
# Terminal-based visual file manager
brew "midnight-commander"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql@5.6"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@10"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Software environment for statistical computing
brew "r"
# Erlang build tool
brew "rebar3"
# Utility that provides fast incremental file transfer
brew "rsync"
# The Rust toolchain installer
brew "rustup-init"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# Experimental implementation of SPDY protocol versions 2, 3, and 3.1
brew "spdylay"
# DNS privacy enabled stub resolver service based on getdns
brew "stubby", restart_service: true
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# File synchronization tool for OSX
brew "unison"
# Extraction utility for .zip compressed archives
brew "unzip"
# Compress/expand executable files
brew "upx"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Manipulate Xcode project files
brew "xcproj"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
cask "dotnet-sdk"
cask "font-fira-code"
cask "font-source-code-pro"
cask "google-cloud-sdk"
cask "julia"
cask "keepingyouawake"
cask "ngrok"
